########################################################################1 квадрат

# a = int(input("введите размер квадрата"))
# for i in range(a):
#
#     for j in range(a):
#
#         print("*", end=" ")
#     print()
############################################################# 2прямоугольник
# a = int(input("введите ширину прямоугольника"))
# b = int(input("введите длину прямоугольника"))
# for i in range(a):
#
#     for j in range(b):
#
#         print("*", end=" ")
#     print()
############################################################# не заполненый квадрат

# a = int(input("введите размер квадрата"))
# for i in range(a):
#     for j in range(a):
#         if (i == 0):
#             print("*", end=" ")
#         elif(j == 0):
#             print("*", end=" ")
#         elif(i == a - 1):
#             print ("*", end=" ")
#         elif(j == a - 1):
#             print ("*", end=" ")
#
#         else:
#             print(" ", end=" ")
#
#     print()

############################################################прямоугольник
# a = int(input("введите длину прямоугольника"))
# b = int(input("введите ширину прямоугольника"))
#
# for i in range(a):
#     for j in range(b):
#         if (i == 0):
#             print("*", end=" ")
#         elif(j == 0):
#             print("*", end=" ")
#         elif(i == a - 1):
#             print ("*", end=" ")
#         elif(j == b - 1):
#             print ("*", end=" ")
#
#         else:
#             print(" ", end=" ")
#
#     print()